#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/managedkube/terraform-environments_aws_dev_vpc/runs/run-FhBx3w7fw3cSgesv

Waiting for the plan to start...

Terraform v0.13.5
Configuring remote state backend...
Initializing Terraform configuration...
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

module.vpc.module.vpc.aws_eip.nat[2]: Refreshing state... [id=eipalloc-027aaedb2c7b41d61]
module.vpc.module.vpc.aws_eip.nat[1]: Refreshing state... [id=eipalloc-0c7a3cfbebd761329]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-08855753a4424e4c8]
module.eks.module.eks.data.aws_ami.eks_worker: Refreshing state... [id=ami-0929625d63a6bc993]
module.eks.module.eks.data.aws_iam_policy_document.cluster_elb_sl_role_creation[0]: Refreshing state... [id=3407219844]
module.eks.module.eks.data.aws_partition.current: Refreshing state... [id=aws]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-017c85961de49415b]
module.eks.module.eks.data.aws_iam_policy_document.cluster_assume_role_policy: Refreshing state... [id=2764486067]
module.eks.module.eks.data.aws_ami.eks_worker_windows: Refreshing state... [id=ami-0434ba620910a5db6]
module.eks.module.eks.data.aws_caller_identity.current: Refreshing state... [id=937803775366]
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/dev/cluster]
module.eks.aws_kms_key.eks: Refreshing state... [id=7dd20734-a971-45cb-b0e0-b5e1f0741176]
module.eks.module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]: Refreshing state... [id=arn:aws:iam::937803775366:policy/dev-elb-sl-role-creation20210422211154741500000001]
module.eks.module.eks.data.aws_iam_policy_document.workers_assume_role_policy: Refreshing state... [id=3778018924]
module.eks.module.eks.aws_iam_role.cluster[0]: Refreshing state... [id=dev20210422211154744400000002]
data.aws_eks_cluster_auth.example: Refreshing state...
data.aws_eks_cluster.example: Refreshing state...
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]: Refreshing state... [id=dev20210422211154744400000002-20210422211155248000000005]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]: Refreshing state... [id=dev20210422211154744400000002-20210422211155249900000006]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]: Refreshing state... [id=dev20210422211154744400000002-20210422211155231700000004]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]: Refreshing state... [id=dev20210422211154744400000002-20210422211155228500000003]
module.argocd.helm_release.argocd: Refreshing state... [id=argocd]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-086276a5c94180740]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05adb37d30930ca62]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06bd62233fc44a36c]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-080ea14ffcf15b610]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-06222463fcf8ad9d6]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-01168ff96ce307455]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0962d8b0985209543]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-074a33d6b331f3765]
module.vpc.module.vpc.aws_route_table.private[1]: Refreshing state... [id=rtb-0b863193e1f988b7a]
module.vpc.module.vpc.aws_route_table.private[2]: Refreshing state... [id=rtb-001c78bdd02662459]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0465ba05fec55710b]
module.eks.module.eks.aws_security_group.workers[0]: Refreshing state... [id=sg-09a2c310515a513d5]
module.eks.module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0d3c4f9acd2ab5ab9]
module.vpc.module.vpc.aws_vpn_gateway.this[0]: Refreshing state... [id=vgw-0852963a93db4c55d]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-080ea14ffcf15b6101080289494]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0280261f63f41c839]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-05da3e7f02535a214]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-09c9b518499dc61d1]
module.eks.module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]: Refreshing state... [id=sgrule-3256506036]
module.eks.module.eks.aws_security_group_rule.workers_ingress_cluster[0]: Refreshing state... [id=sgrule-530602171]
module.eks.module.eks.aws_security_group_rule.cluster_egress_internet[0]: Refreshing state... [id=sgrule-116206551]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0b84c653371ac4fb3]
module.eks.module.eks.aws_security_group_rule.workers_ingress_self[0]: Refreshing state... [id=sgrule-3057396362]
module.eks.module.eks.aws_security_group_rule.workers_egress_internet[0]: Refreshing state... [id=sgrule-66283619]
module.eks.module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]: Refreshing state... [id=sgrule-3557899123]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0c2dc224254f732a7]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0aab702b4aac10817]
module.vpc.module.vpc.aws_nat_gateway.this[2]: Refreshing state... [id=nat-02adbec97edb46608]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-071355cac8d1bd0c6]
module.vpc.module.vpc.aws_nat_gateway.this[1]: Refreshing state... [id=nat-092bd35f4ced5c26a]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=dev]
module.vpc.module.vpc.aws_route.private_nat_gateway[2]: Refreshing state... [id=r-rtb-001c78bdd026624591080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0465ba05fec55710b1080289494]
module.vpc.module.vpc.aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0b863193e1f988b7a1080289494]
module.eks.module.eks.null_resource.wait_for_cluster[0]: Refreshing state... [id=5434368667755319216]
module.eks.module.eks.aws_iam_role.workers[0]: Refreshing state... [id=dev20210422212122618100000009]
module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::937803775366:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/05C59863A048CA407B92595C01041B34]
module.eks.data.aws_eks_cluster_auth.cluster: Refreshing state... [id=dev]
module.eks.data.aws_eks_cluster.cluster: Refreshing state... [id=dev]
module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]: Refreshing state... [id=dev20210422212122618100000009-2021042221212309330000000a]
module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]: Refreshing state... [id=dev20210422212122618100000009-2021042221212408330000000b]
module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]: Refreshing state... [id=dev20210422212122618100000009-2021042221212548780000000c]
module.eks.module.eks.kubernetes_config_map.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.module.eks.module.node_groups.random_pet.node_groups["ng1"]: Refreshing state... [id=resolved-yak]
module.eks.module.eks.module.node_groups.aws_eks_node_group.workers["ng1"]: Refreshing state... [id=dev:dev-ng1-resolved-yak]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.argocd.helm_release.argocd will be destroyed
  - resource "helm_release" "argocd" {
      - atomic                     = false -> null
      - chart                      = "argo-cd" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "argocd" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = [
          - {
              - app_version = "2.0.0"
              - chart       = "argo-cd"
              - name        = "argocd"
              - namespace   = "argocd"
              - revision    = 1
              - values      = jsonencode(
                    {
                      - installCRDs = false
                    }
                )
              - version     = "3.2.0"
            },
        ] -> null
      - name                       = "argocd" -> null
      - namespace                  = "argocd" -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://argoproj.github.io/argo-helm" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - values                     = [
          - <<~EOT
                ---
                installCRDs: false
            EOT,
        ] -> null
      - verify                     = false -> null
      - version                    = "3.2.0" -> null
      - wait                       = true -> null
    }

  # module.argocd.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "argo-cd"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd"
      + namespace                  = "argocd"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<~EOT
                ---
                installCRDs: false
            EOT,
        ]
      + verify                     = false
      + version                    = "3.2.0"
      + wait                       = true
    }

  # module.kube-prometheus-stack.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "kube-prometheus-stack"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "kube-prometheus-stack"
      + namespace                  = "monitoring"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://prometheus-community.github.io/helm-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<~EOT
                ---
                namespaceOverride: monitoring
                # prometheusOperator:
                #   nodeSelector:
                #     app-type: my-app
                #   tolerations:
                #   - key: "app-type"
                #     operator: "Equal"
                #     value: "my-app"
                #     effect: "NoSchedule"
                # prometheus:
                #   prometheusSpec:
                #     nodeSelector:
                #       app-type: my-app
                #     tolerations:
                #     - key: "app-type"
                #       operator: "Equal"
                #       value: "my-app"
                #       effect: "NoSchedule"
                alertmanager:
                  enabled: true
                  # alertmanagerSpec:
                  #   nodeSelector:
                  #     app-type: my-app
                  #   tolerations:
                  #   - key: "app-type"
                  #     operator: "Equal"
                  #     value: "my-app"
                  #     effect: "NoSchedule"
                nodeExporter:
                  # nodeSelector:
                  #   app-type: my-app
                  # tolerations:
                  # - key: "app-type"
                  #   operator: "Equal"
                  #   value: "my-app"
                  #   effect: "NoSchedule"
                grafana:
                  ingress:
                    enabled: true
                    annotations:
                      kubernetes.io/ingress.class: ingress-external
                    hosts:
                    - grafana.kubernetes-ops.com
                  nodeSelector:
                    app-type: my-app
                  tolerations:
                  - key: "app-type"
                    operator: "Equal"
                    value: "my-app"
                    effect: "NoSchedule"
            EOT,
        ]
      + verify                     = false
      + version                    = "14.5.0"
      + wait                       = true
    }

  # module.nginx-ingress.helm_release.helm_chart will be created
  + resource "helm_release" "helm_chart" {
      + atomic                     = false
      + chart                      = "ingress-nginx"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "nginx-ingress"
      + namespace                  = "nginx-ingress"
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/ingress-nginx"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<~EOT
                ---
                controller:
                  ingressClass: ingress-external
                  # Turning off the ingress admission webhook for validating the ingress spec.
                  # There is something that is blocking the GKE Kube API from reaching this service
                  # admissionWebhooks:
                  #   enabled: false
                  containerPort:
                    http: 80
                    https: 443
                  service:
                    annotations:
                      # https://kubernetes.io/docs/concepts/services-networking/service/#internal-load-balancer
                      service.beta.kubernetes.io/aws-load-balancer-internal: "false"
                  # nodeSelector:
                  #   app-type: my-node
                  # tolerations:
                  # - key: "app-type"
                  #   operator: "Equal"
                  #   value: "my-node"
                  #   effect: "NoSchedule"
            EOT,
        ]
      + verify                     = false
      + version                    = "3.23.0"
      + wait                       = true
    }

Plan: 3 to add, 0 to change, 1 to destroy.

```

</details>
*Pusher: @sekka1, Action: `pull_request`*